Revit 2024 API
ParameterTypeId.WallCrossSection Property
 "Cross-Section"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallCrossSection { get; }
Visual Basic
Public Shared ReadOnly Property WallCrossSection As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallCrossSection {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace